---
type: PanelScheduleSheetInstance
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 6
tags: [revit-api, class]
---

# PanelScheduleSheetInstance

`Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2011 | `public static PanelScheduleSheetInstance Create ( Document ADoc , ElementId scheduleId , View DBView )` |
| Method | GetSchedule | 2011 | `public PanelScheduleView GetSchedule ()` |
| Method | SplitSegment | 2011 | `public bool SplitSegment ( int iSeg )` |
| Property | Origin | 2011 | `public XYZ Origin { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | ScheduleId | 2011 | `public ElementId ScheduleId { get ; set ; }` |